#大数的进制转换
#数据范围1000位以内，输入进制2-62，转换进制2-62
# 0-9 10-35(A-Z) 36-62(a-z)

while True:
    try:
        旧进制,新进制,原数 = input().split()
        旧进制 = int(旧进制)
        新进制 = int(新进制)

        十进制数 = 0
        阶位 = 1
        for 每一位数 in 原数[::-1]:
            值= 0
            if '0'<=每一位数<='9':   值 = int(每一位数)
            elif 'A'<=每一位数<'Z':  值 = ord(每一位数)-ord('A')+10
            elif 'a'<=每一位数<'z':  值 = ord(每一位数)-ord('a')+36
            十进制数 += 值*阶位
            阶位*=旧进制

        #print(十进制数)
        新进制数 = []
        while 十进制数!=0:
            值 = 十进制数%新进制
            if 10<=值<=35:      值 = chr(值+ord('A')-10)
            elif 36<=值<=62:    值 = chr(值+ord('a')-36)
            新进制数.append(值)
            十进制数//=新进制

        for 每一位数 in 新进制数[::-1]:
            print(每一位数,end='')
        print('')
    except:
        exit()